#include"weapon&tool.h"

struct bullet weapon[15];
struct tool_plane tool [25] ;
//struct bullet {//子弹
//	int x, y;
//	double angle;  //与y轴负半轴，上方，夹角
//	int harm;
//	int speed;
//	int ID_bullet;
//};
void weapon_init() {
	weapon[0] = { 0,0,0,30,3,0 };//初始雪豹
	weapon[1] = { 0,0,0,40,4,1 };//高燃爆弹
	weapon[2] = { 0,0,0,35,4,2 };//阿姆斯特朗回旋喷气式阿姆斯特朗炮
	weapon[3] = { 0,0,0,25,5,3 };//金箍棒
	weapon[4] = { 0,0,0,45,3,4 };//天火圣裁
	weapon[5] = { 0,0,0,45,4,5 };//炮
	weapon[6] = { 0,0,0,45,5,6 };//电子烟
	weapon[7] = { 0,0,0,35,5,7 };//手
}

//struct tool_plane {
//	int life;//直接恢复等量的血
//	int max_life;//增加最大生命值并且增加等量血量值
//	int percent_life;//根据数值恢复最大生命值的百分比血量
//	int power;//直接增加等量的攻击力
//	int precent_power;//依据飞机现有攻击力根据数值增加百分比攻击
//	int x;
//	int y;//改变x，y轴坐标
//	int width;
//	int height;//改变飞机大小
//	int buff_speed;//提供给飞机的速度大小
//	int self_speed;//自身道具掉落速度
//	int bullet_num;  //增加子弹数量
//	int ID_tool;//每个道具的特有的特殊值，用来区分道具，从零开始，每多一个加1
//};

void tool_init() {
	tool[0] = { 10,20,0,10,0,0,0,0,0,0,3,0,0 };
	tool[1] = { 20,20,10,0,0,0,0,0,0,0,3,0,1 };//最后一个数以此类推
	tool[2] = { 0,0,40,20,0,0,0,0,0,0,3,0,2 };
	tool[3] = { 0,0,30,0,0,0,0,0,0,0,3,0,3 };
	tool[4] = { 40,0,0,20,0,0,0,0,0,0,3,0,4 };
	tool[5] = { 0,0,0,0,0,0,0,0,0,0,3,1,5 };
	tool[6] = { 0,0,0,0,20,0,0,0,0,2,3,0,6 };
	tool[7] = { 0,20,0,20,0,0,0,0,0,2,3,0,7 };
	tool[8] = { 0,0,30,-10,0,0,0,0,0,-1,3,0,8 };
	tool[9] = { 50,30,0,0,0,0,0,0,0,0,3,0,9 };
	tool[10] = { 0,-10,0,30,0,0,0,0,0,-1,3,0,10 };
	tool[11] = { 0,0,0,20,0,0,0,0,0,-1,3,1,11 };
	tool[12] = { 15,0,0,0,15,0,0,0,0,-1,3,0,12 };
	tool[13] = { 0,0,0,20,0,0,0,0,0,1,3,1,13 };
	tool[14] = { 0,0,0,0,0,250,250,0,0,0,3,0,14 };
	tool[15] = { 10,20,0,10,0,-300,-400,0,0,0,3,0,15 };
	tool[16] = { 0,0,0,30,0,0,0,0,0,-1,3,1,16 };
	tool[17] = { 0,0,50,0,20,0,0,0,0,0,3,0,17 };
	tool[18] = { 0,30,0,30,0,0,0,0,0,2,3,1,18 };
}

